<center><h3>Data Science with Pandas</h3></center>
<center><h5>Notes By</h5></center>
<center><h4>Jagdish Chavan</h4></center>


Welcome to Data Science with Pandas, where you will learn both the concept behind Pandas model as well as its implementation of it in Python.

My name is Jagdish Chavan as a working Data Scientist and Industry Trainer, my Courses have been enrolled by over 1000 + students holding B.Sc in Computer Science with Mathematics and Statistics and I have experience in Building Projects in Data Science, ML, DL application and the consulting industry.

While doing my Job, I realized That many Data analysts and beginners in the field of data analytics are overwhelmed by Pandas. here focus will be on students who want to expand their skill set with Pandas.

As practising data scientist needs to know from concept to code without getting too much mathematical about it. if you regularly put one hour a day within a week, you will be able to make support vector machine-based models and answer SVM-related interview questions.

The prerequisite for Data Science with Pandas will be knowledge of Core and Advance Python then we will familiarize ourself with the core mechanics of pandas

* two primary data structures: the one-dimensional Series and the two-dimensional       DataFrame.
* in-depth exploration of the Series, learn how to create a Series from scratch import it from an external data set; and apply a slew of mathematical, statistical,and logical operations to it.
* introduce the tabular DataFrame and various ways to extract rows, columns, and values from its data
* focuses on extracting subsets of DataFrame rows by applying logical criteria.
* we’ll work through eight datasets that cover everything from box-office grosses to NBA players to Pokémon.

this notes will be ideal for an existing Business analyst or data analyst who wants to expand on current skills or a student who wants to have a career in data science. 

We’ll be using the Jupyter Notebook development environment to write our code
throughout the book. If you need help setting up pandas and Jupyter Notebook on
your computer feel free to go through Linkedin Article on Data Science and for datasets you may visit my github repository on Data Science.

### Importing Data Set

In [2]:
# importing a data set

#import pandas library
import pandas as pd

Our data is stored in a single movies.csv file. A CSV (comma-separated values) file
is a plain-text file that separates each row of data with a line break and each row value
with a comma. The first row in the file holds the column headers for the data. Here’s
a preview of the first three rows of movies.csv:

Rank,Title,Studio,Gross,Year
1,Avengers: Endgame,Buena Vista,"$2,796.30",2019
2,Avatar,Fox,"$2,789.70",2009

The first row lists the five columns in the data set: Rank, Title, Studio, Gross, and Year.The second row holds the first record or, equivalently, the data for the first movie. Thefilm has a Rank of 1, a Title of "Avengers: Endgame", a Studio of "Buena Vista", a Gross of "$2,796.30", and a Year of 2019. The next line holds the values for the
next movie, and the pattern repeats for the remaining 750-plus rows in the data set.

**The read_csv() function is used to retrieve data from csv file. The syntax of read_csv() method is:**

pd.read_csv(filepath_or_buffer, sep=', ', delimiter=None, header='infer', names=None, index_col=None, 
             usecols=None, squeeze=False, prefix=None, mangle_dupe_cols=True, 
             dtype=None, engine=None, converters=None, true_values=None, false_values=None, 
             skipinitialspace=False, skiprows=None, nrows=None, na_values=None, keep_default_na=True, 
             na_filter=True, verbose=False, skip_blank_lines=True, parse_dates=False, infer_datetime_format=False, 
             keep_date_col=False, date_parser=None, dayfirst=False, iterator=False, chunksize=None, compression='infer', 
             thousands=None, decimal=b'.', lineterminator=None, quotechar='"', quoting=0, escapechar=None, comment=None, 
             encoding=None, dialect=None, tupleize_cols=None, error_bad_lines=True, warn_bad_lines=True, skipfooter=0, 
             doublequote=True, delim_whitespace=False, low_memory=True, memory_map=False, float_precision=None)

In [3]:
data =pd.read_csv('D:\datascience\pandas\dset\movies.csv')
print(data)

     Rank                         Title           Studio       Gross  Year
0       1             Avengers: Endgame      Buena Vista  $2,796.30   2019
1       2                        Avatar              Fox  $2,789.70   2009
2       3                       Titanic        Paramount  $2,187.50   1997
3       4  Star Wars: The Force Awakens      Buena Vista  $2,068.20   2015
4       5        Avengers: Infinity War      Buena Vista  $2,048.40   2018
..    ...                           ...              ...         ...   ...
777   778                     Yogi Bear  Warner Brothers    $201.60   2010
778   779           Garfield: The Movie              Fox    $200.80   2004
779   780                   Cats & Dogs  Warner Brothers    $200.70   2001
780   781      The Hunt for Red October        Paramount    $200.50   1990
781   782                      Valkyrie              MGM    $200.30   2008

[782 rows x 5 columns]

* Pandas imports the CSV file’s contents into an object called a DataFrame. 
* Think of an object as a container for storing data. Different objects are optimized for different types of data, and we interact with them in different ways. 
* Pandas uses one type of object (the DataFrame) to store multicolumn data sets and another type of object (the Series) to store single-column data sets. 
* A DataFrame is comparable to a multicolumn table in Excel.
* To avoid cluttering the screen, pandas displays only the first five and last five rows
of the DataFrame. 
* A row of ellipses ( . . . ) marks where the data gap occurs.
* This DataFrame consists of five columns (Rank, Title, Studio, Gross, Year) and an
index. 
* The index is the range of ascending numbers on the left side of the Data-
Frame. 
* Index labels serve as identifiers for rows of data. We can set any column as the
index of the DataFrame. 
* When we do not explicitly tell pandas which column to use,the library generates a numeric index starting from 0.

**What column is a good candidate for the index?**
 * It’s one whose values can act as a primary identifier or point of reference for each row. 
 * Among our five columns, Rank and Title are the two best options. Let’s swap the autogenerated numeric index with the values from the Title column. 
 * We can do so directly during the CSV import:

In [4]:
data = pd.read_csv("D:/datascience/pandas/dset/movies.csv", index_col='Title')
print(data)

                              Rank           Studio       Gross  Year
Title
Avengers: Endgame                1      Buena Vista  $2,796.30   2019
Avatar                           2              Fox  $2,789.70   2009
Titanic                          3        Paramount  $2,187.50   1997
Star Wars: The Force Awakens     4      Buena Vista  $2,068.20   2015
Avengers: Infinity War           5      Buena Vista  $2,048.40   2018
...                            ...              ...         ...   ...
Yogi Bear                      778  Warner Brothers    $201.60   2010
Garfield: The Movie            779              Fox    $200.80   2004
Cats & Dogs                    780  Warner Brothers    $200.70   2001
The Hunt for Red October       781        Paramount    $200.50   1990
Valkyrie                       782              MGM    $200.30   2008

[782 rows x 4 columns]

### Manipulating a DataFrame

**The head()** function is used to get the first n rows.

* This function returns the first n rows for the object based on position. It is useful for quickly testing if your object has the right type of data in it.

**Syntax**: 
DataFrame.head(self, n=5)

In [5]:
print(data.head(5))

                              Rank       Studio       Gross  Year
Title
Avengers: Endgame                1  Buena Vista  $2,796.30   2019
Avatar                           2          Fox  $2,789.70   2009
Titanic                          3    Paramount  $2,187.50   1997
Star Wars: The Force Awakens     4  Buena Vista  $2,068.20   2015
Avengers: Infinity War           5  Buena Vista  $2,048.40   2018

**The tail()** function is used to get the last n rows.

* This function returns last n rows from the object based on position. It is useful for quickly verifying data, for example, after sorting or appending rows.

**Syntax:** DataFrame.tail(self,n=5)

In [6]:
print(data.tail(5))

                          Rank           Studio     Gross  Year
Title
Yogi Bear                  778  Warner Brothers  $201.60   2010
Garfield: The Movie        779              Fox  $200.80   2004
Cats & Dogs                780  Warner Brothers  $200.70   2001
The Hunt for Red October   781        Paramount  $200.50   1990
Valkyrie                   782              MGM  $200.30   2008

**The len()** function returns the number of items in an object.

* When the object is a string, the len() function returns the number of characters in the string.

**syntax:** len(object)

In [7]:
print(len(data))

782

**shape:** Returns tuple of shape (Rows, columns) of dataframe/series
* gives number of rows and columns in the dataframe.

**syntax**: data.shape()

In [8]:
print(data.shape)

(782, 4)

**size:** gives information about total number of cells.

**syntax:** data.size

In [9]:
print(data.size)

3128

**dtypes:** Gives data type of columns.

**syntax:** data.dtypes

In [10]:
print(data.dtypes)

Rank       int64
Studio    object
Gross     object
Year       int64
dtype: object

**iloc:** extract a row from the data set by its numeric order in line, also called its index position

**syntax:** data.iloc[]

In [11]:
print(data.iloc[499])

Rank           500
Studio         Fox
Gross     $288.30
Year          2018
Name: Maze Runner: The Death Cure, dtype: object

* Pandas returns a new object here called a Series, a one-dimensional labeled array of
values. 
* Think of it as a single column of data with an identifier for each row. 
* Notice that the Series’ index labels (Rank, Studio, Gross, and Year) are the four columns from the movies DataFrame. 
* Pandas has altered the presentation of the original row’s values.

**loc:** extracts a row by its index label rather than its numeric position

**syntax:** data.loc

In [12]:
print(data.loc['Forrest Gump'])

Rank            119
Studio    Paramount
Gross      $677.90
Year           1994
Name: Forrest Gump, dtype: object

* Index labels can contain duplicates. Two movies in the DataFrame have the title "101
Dalmatians", for example (the 1961 original and the 1996 remake):

In [13]:
print(data.loc['101 Dalmatians'])

                Rank       Studio     Gross  Year
Title
101 Dalmatians   425  Buena Vista  $320.70   1996
101 Dalmatians   708  Buena Vista  $215.90   1961

**sort_values:** sort the DataFrame by the values in another column.

**syntax:** data.sort_values()

In [14]:
print(data.sort_values(by='Year', ascending=False).head())

                                            Rank                  Studio  \
Title
Avengers: Endgame                              1             Buena Vista
John Wick: Chapter 3 - Parabellum            458               Lionsgate
The Wandering Earth                          114  China Film Corporation
Toy Story 4                                  198             Buena Vista
How to Train Your Dragon: The Hidden World   199               Universal

                                                 Gross  Year
Title
Avengers: Endgame                           $2,796.30   2019
John Wick: Chapter 3 - Parabellum             $304.70   2019
The Wandering Earth                           $699.80   2019
Toy Story 4                                   $519.80   2019
How to Train Your Dragon: The Hidden World    $519.80   2019

* We can also sort DataFrames by values across multiple columns.
* Let’s sort movies first by the Studio column’s values and then by the Year column’s values. 
* Now we can see the films organized alphabetically by both studio and release date:

In [15]:
print(data.sort_values(by=['Studio','Year']).head())

                         Rank       Studio     Gross  Year
Title
The Blair Witch Project   588      Artisan  $248.60   1999
101 Dalmatians            708  Buena Vista  $215.90   1961
The Jungle Book           755  Buena Vista  $205.80   1967
Who Framed Roger Rabbit   410  Buena Vista  $329.80   1988
Dead Poets Society        636  Buena Vista  $235.90   1989

**sort_index():** sort the index, which is helpful if we want to see the data in alphabetical order

**syntax:** data.sort_index()

In [16]:
print(data.sort_index().head())

                  Rank           Studio     Gross  Year
Title
10,000 B.C.        536  Warner Brothers  $269.80   2008
101 Dalmatians     708      Buena Vista  $215.90   1961
101 Dalmatians     425      Buena Vista  $320.70   1996
2 Fast 2 Furious   632        Universal  $236.40   2003
2012                93             Sony  $769.70   2009

**Note:**

* The operations we’ve performed so far return new DataFrame objects. Pandas has not
altered the original movies DataFrame from the CSV file. 
* The nondestructive nature of these operations is beneficial; it actively encourages experimentation. 
* We can always confirm that a result is correct before making it permanent.

### Counting values in a Series

* We can extract a single column of data from a DataFrame as a Series. 
* Notice that pandas preserves the DataFrame’s index, the movie titles, in the Series:

In [17]:
print(data['Studio'])

Title
Avengers: Endgame                   Buena Vista
Avatar                                      Fox
Titanic                               Paramount
Star Wars: The Force Awakens        Buena Vista
Avengers: Infinity War              Buena Vista
                                     ...
Yogi Bear                       Warner Brothers
Garfield: The Movie                         Fox
Cats & Dogs                     Warner Brothers
The Hunt for Red October              Paramount
Valkyrie                                    MGM
Name: Studio, Length: 782, dtype: object

* If a Series has a large number of rows, pandas truncates the data set to show only the
first five and the last five rows.
* Now that we’ve isolated the Studio column, we can count each unique value’s
number of occurrences. 
* Let’s limit our results to the top 10 studios:

In [18]:
print(data['Studio'].value_counts().head(10))

Warner Brothers    132
Buena Vista        125
Fox                117
Universal          109
Sony                86
Paramount           76
Dreamworks          27
Lionsgate           21
New Line            16
MGM                 11
Name: Studio, dtype: int64

* pandas uses the studios from the Studio column as the index labels and their counts as the Series values.

### Filtering a column by one or more criteria

* You’ll often want to extract a subset of rows based on one or more criteria. Excel
offers the Filter tool for this exact purpose.

* What if we wanted to find only the films released by Universal Studios? We can
accomplish this task with one line of code in pandas:

In [19]:
data[data["Studio"] == "Universal"]

                                Rank     Studio       Gross  Year
Title
Jurassic World                     6  Universal  $1,671.70   2015
Furious 7                          8  Universal  $1,516.00   2015
Jurassic World: Fallen Kingdom    13  Universal  $1,309.50   2018
The Fate of the Furious           17  Universal  $1,236.00   2017
Minions                           19  Universal  $1,159.40   2015
...                              ...        ...         ...   ...
The Break-Up                     763  Universal    $205.00   2006
Everest                          766  Universal    $203.40   2015
Patch Adams                      772  Universal    $202.30   1998
Kindergarten Cop                 775  Universal    $202.00   1990
Straight Outta Compton           776  Universal    $201.60   2015

[109 rows x 4 columns]

We can assign the filtering condition to a variable to provide context for readers:

In [20]:
released_by_universal = (data["Studio"] == "Universal")
print(data[released_by_universal].head())

                                Rank     Studio       Gross  Year
Title
Jurassic World                     6  Universal  $1,671.70   2015
Furious 7                          8  Universal  $1,516.00   2015
Jurassic World: Fallen Kingdom    13  Universal  $1,309.50   2018
The Fate of the Furious           17  Universal  $1,236.00   2017
Minions                           19  Universal  $1,159.40   2015

* We can also filter DataFrame rows by multiple criteria. The next example targets all
movies released by Universal Studios and released in 2015:

In [21]:
released_by_universal = data["Studio"] == "Universal"
released_in_2015 = data["Year"] == 2015
data[released_by_universal & released_in_2015]

                        Rank     Studio       Gross  Year
Title
Jurassic World             6  Universal  $1,671.70   2015
Furious 7                  8  Universal  $1,516.00   2015
Minions                   19  Universal  $1,159.40   2015
Fifty Shades of Grey     165  Universal    $571.00   2015
Pitch Perfect 2          504  Universal    $287.50   2015
Ted 2                    702  Universal    $216.70   2015
Everest                  766  Universal    $203.40   2015
Straight Outta Compton   776  Universal    $201.60   2015

* The previous example includes rows that satisfied both conditions.
* We can also filter for films that fit either condition: released by Universal or released in 2015. The resulting DataFrame is longer because more films have a chance of satisfying one of the two conditions instead of both:

In [22]:
released_by_universal = data["Studio"] == "Universal"
released_in_2015 = data["Year"] == 2015
data[released_by_universal | released_in_2015]

                                Rank       Studio       Gross  Year
Title
Star Wars: The Force Awakens       4  Buena Vista  $2,068.20   2015
Jurassic World                     6    Universal  $1,671.70   2015
Furious 7                          8    Universal  $1,516.00   2015
Avengers: Age of Ultron            9  Buena Vista  $1,405.40   2015
Jurassic World: Fallen Kingdom    13    Universal  $1,309.50   2018
...                              ...          ...         ...   ...
The Break-Up                     763    Universal    $205.00   2006
Everest                          766    Universal    $203.40   2015
Patch Adams                      772    Universal    $202.30   1998
Kindergarten Cop                 775    Universal    $202.00   1990
Straight Outta Compton           776    Universal    $201.60   2015

[140 rows x 4 columns]

* We can target column values less than or greater than a specific value, for example. Here, we target movies released before 1975:

In [23]:
before_1975 = data["Year"] < 1975
data[before_1975]

                    Rank           Studio     Gross  Year
Title
The Exorcist         252  Warner Brothers  $441.30   1973
Gone with the Wind   288              MGM  $402.40   1939
Bambi                540              RKO  $267.40   1942
The Godfather        604        Paramount  $245.10   1972
101 Dalmatians       708      Buena Vista  $215.90   1961
The Jungle Book      755      Buena Vista  $205.80   1967

* We can also specify a range between which all values must fall. The next example pulls out movies released between 1983 and 1986:

In [24]:
mid_80s = data["Year"].between(1983, 1986)
data[mid_80s]

                                      Rank     Studio     Gross  Year
Title
Return of the Jedi                     222        Fox  $475.10   1983
Back to the Future                     311  Universal  $381.10   1985
Top Gun                                357  Paramount  $356.80   1986
Indiana Jones and the Temple of Doom   403  Paramount  $333.10   1984
Crocodile Dundee                       413  Paramount  $328.20   1986
Beverly Hills Cop                      432  Paramount  $316.40   1984
Rocky IV                               467        MGM  $300.50   1985
Rambo: First Blood Part II             469    TriStar  $300.40   1985
Ghostbusters                           485   Columbia  $295.20   1984
Out of Africa                          662  Universal  $227.50   1985

* We can also use the DataFrame index to filter rows. The next example lowercases the movie titles in the index and finds all movies with the word "dark" in their title:

In [25]:
has_dark_in_title = data.index.str.lower().str.contains("dark")
data[has_dark_in_title]

                                Rank           Studio       Gross  Year
Title
Transformers: Dark of the Moon    23        Paramount  $1,123.80   2011
The Dark Knight Rises             27  Warner Brothers  $1,084.90   2012
The Dark Knight                   39  Warner Brothers  $1,004.90   2008
Thor: The Dark World             132      Buena Vista    $644.60   2013
Star Trek Into Darkness          232        Paramount    $467.40   2013
Fifty Shades Darker              309        Universal    $381.50   2017
Dark Shadows                     600  Warner Brothers    $245.50   2012
Dark Phoenix                     603              Fox    $245.10   2019

### Grouping data

* We might be curious which studio had the highest total grosses across all films. 
* Let’s aggregate the values in the Gross column by studio.
* Our first dilemma is that the Gross column’s values are stored as text rather than as numbers. 
* Pandas imported the column’s values as text to preserve the dollar signs and
comma symbols in the original CSV. 
* We can convert the column’s values to decimal numbers, but only if we remove both of those characters. The next example replaces all occurrences of "$" and "," with empty text. T
* his operation is similar to Find and Replace in Excel:

In [29]:
(
data["Gross"]
.str.replace("$", "", regex = False)
.str.replace(",", "", regex = False)
)

Title
Avengers: Endgame               2796.30
Avatar                          2789.70
Titanic                         2187.50
Star Wars: The Force Awakens    2068.20
Avengers: Infinity War          2048.40
                                  ...
Yogi Bear                        201.60
Garfield: The Movie              200.80
Cats & Dogs                      200.70
The Hunt for Red October         200.50
Valkyrie                         200.30
Name: Gross, Length: 782, dtype: object

* With the symbols gone, we can convert the Gross column’s values from text to floating-point numbers:

In [28]:
(
data["Gross"]
.str.replace("$", "", regex = False)
.str.replace(",", "", regex = False)
.astype(float)
)

Title
Avengers: Endgame               2796.3
Avatar                          2789.7
Titanic                         2187.5
Star Wars: The Force Awakens    2068.2
Avengers: Infinity War          2048.4
                                 ...
Yogi Bear                        201.6
Garfield: The Movie              200.8
Cats & Dogs                      200.7
The Hunt for Red October         200.5
Valkyrie                         200.3
Name: Gross, Length: 782, dtype: float64

* these operations are temporary and do not modify the original Gross
Series. 
* In all the previous examples, pandas created a copy of the original data structure,performed the operation, and returned a new object. 
* The next example explicitly overwrites the Gross column in movies with a new column of decimal-point numbers. 
* Now the transformation is permanent:

In [30]:
data["Gross"]=(
    data["Gross"]
    .str.replace("$","",regex=False)
    .str.replace(",","",regex=False)
    .astype(float)
)

* Our data type conversion opens the door to more calculations and manipulations.
The next example calculates the average box-office gross of the movies:

In [31]:
data["Gross"].mean()

439.0308184143222

if you have any doubts or queries through the series you can post them in the comments, as soon as get free time I will be personally solving all your doubts, notebooks, code and data sets required for practice will be available on the dedicated GitHub repository. 

Finally, one request if you really like what you read and acquire knowledge about feel free to share the article with your Friends, Colleagues, students or anyone you might think will benefit from this. sharing is caring.